#  filter
#  第一个参数. 函数. 将第二个参数中的每一个元素传给函数. 函数如果返回True, 留下该元素.

lis = [1,3,4,4,5,6,7,8,9]
ret = filter(lambda x:x%3 == 0 ,lis)
print(ret,type(ret))
print(list(ret))


# map
# 把第二个参数的每个元素传递给第一个参数进行处理，处理的结果返回成迭代器
lst = [1,2,3,4,5,6,7,8,9,0,23,23,4,52,35,234,234,234,234,234,23,4]
ma = map(lambda x:x*x,lst)
print(ma,type(ma))
print(list(ma))
lst1 = [1,2,3,4,5,6,4,8,9,0,23,5,4,2,1,5,7,234,3,234,23,4]
lst2 = [1,2,3,4,5,6,7,8,9,0,5,23,4,0,6,3,234,3,6,234,23,4]
mm = map(lambda x,y:x+y,lst1,lst2)   # 如果有多个参数，后面的列表要一一对应